package Lesson4;

public class Main2 {
    public static void main(String[] args) {
        /**
         * 1) publlic доступен всему проекту
         *    "    " доступе внутри пакета
         *    private Доступен внутри класса
         *    protected доступен внутри пакета ***
         *
         *  2) static -относится к классу
         *    "     "-относится к обьекту
         *
         *  3) возвращаемое значение пример: void- пустой
         *   int число / string текст
         *
         *   4)Наименование Метода любое
         *   5) пааметры ()
         *   6)тело метода {}
         */
        String[][] mas = {{"Турция", "60", "3 звезд", "Самолет", "3 раза"},
                {"Турция", "70", "4 звезд", "Самолет", "3 раза"},
                {"Турция", "100", "5 звезд", "Самолет", "3 раза"},
                {"Египет", "50", "2 звезд", "Самолет", "0 раза"},
                {"Дагестан", "60", "3 звезд", "Поезд", "3 раза"},
                {"Германия", "100", "3 звезд", "Автобус", "1 раза"}};

        Ture.getCountry(mas, "Турция");
        Ture t = new Ture();
        t.delCountry(mas, "Турция");
        int i = Integer.parseInt("11");
        System.out.println();
        Ture.getCountry(mas,"Турция",65);

        System.out.println();
        int a = Ture.summ(3,5);
        System.out.println(a);

    }

    // метод печатает все направления в диопазоне цены

}
